### 第7章 数据清洗与准备

In [2]:
import numpy as np
import pandas as pd

In [3]:
string_data = pd.Series(["aardvark", "artichoke", np.nan, "avocado"])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan * 3], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[3] = np.nan

In [13]:
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7 ,3))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

In [16]:
df

          0         1         2
0 -0.008387       NaN       NaN
1  0.374323       NaN       NaN
2  0.395850       NaN -0.553286
3  2.070782       NaN -1.598168
4 -0.478145  2.268995  1.426667
5  0.340728  1.862161  0.343444
6 -1.762484 -1.219356  0.343238

#### 保留至少有thresh个非空值的行或列

In [17]:
df.dropna(thresh=2)

          0         1         2
2  0.395850       NaN -0.553286
3  2.070782       NaN -1.598168
4 -0.478145  2.268995  1.426667
5  0.340728  1.862161  0.343444
6 -1.762484 -1.219356  0.343238

In [18]:
df.fillna(0)

          0         1         2
0 -0.008387  0.000000  0.000000
1  0.374323  0.000000  0.000000
2  0.395850  0.000000 -0.553286
3  2.070782  0.000000 -1.598168
4 -0.478145  2.268995  1.426667
5  0.340728  1.862161  0.343444
6 -1.762484 -1.219356  0.343238

In [19]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.008387  0.500000  0.000000
1  0.374323  0.500000  0.000000
2  0.395850  0.500000 -0.553286
3  2.070782  0.500000 -1.598168
4 -0.478145  2.268995  1.426667
5  0.340728  1.862161  0.343444
6 -1.762484 -1.219356  0.343238

In [20]:
df.fillna(0, inplace=True)

In [21]:
df

          0         1         2
0 -0.008387  0.000000  0.000000
1  0.374323  0.000000  0.000000
2  0.395850  0.000000 -0.553286
3  2.070782  0.000000 -1.598168
4 -0.478145  2.268995  1.426667
5  0.340728  1.862161  0.343444
6 -1.762484 -1.219356  0.343238

In [22]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.135115 -0.500471  0.253513
1 -1.205009 -0.260265  1.619016
2 -0.392574       NaN  1.733659
3  0.497661       NaN  0.224741
4  0.817594       NaN       NaN
5  1.612880       NaN       NaN

In [23]:
df.fillna(method="ffill")

          0         1         2
0  0.135115 -0.500471  0.253513
1 -1.205009 -0.260265  1.619016
2 -0.392574 -0.260265  1.733659
3  0.497661 -0.260265  0.224741
4  0.817594 -0.260265  0.224741
5  1.612880 -0.260265  0.224741

In [24]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  0.135115 -0.500471  0.253513
1 -1.205009 -0.260265  1.619016
2 -0.392574 -0.260265  1.733659
3  0.497661 -0.260265  0.224741
4  0.817594       NaN  0.224741
5  1.612880       NaN  0.224741

In [25]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [26]:
data.fillna(method="ffill")

0    1.0
1    1.0
2    3.5
3    3.5
4    7.0
dtype: float64

In [27]:
data.fillna(method="bfill")

0    1.0
1    3.5
2    3.5
3    7.0
4    7.0
dtype: float64

In [28]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [29]:
data = pd.DataFrame({
    "k1": ["one", "two"] * 3 + ["two"],
    "k2": [1, 1, 2, 3, 3, 4, 4]
})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
data = pd.DataFrame({
    "food": ["bacon", "pulled pork", "bacon", "Pastrami", "corned beef", "Bacon", "Pastrami", "honey ham", "nova lox"],
    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     Pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

In [36]:
data["food"] = data["food"].str.lower()

In [37]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [38]:
data["animal"] = data["food"].map(lambda x: meat_to_animal.get(x, None))

In [39]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [40]:
data["animal"] = data["food"].map(meat_to_animal)

In [41]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [42]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [44]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [45]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=["Ohio", "Colorado", "New York"], columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [46]:
data.index.map(lambda x: x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
data.index = data.index.map(lambda x: x[:4].upper())
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [48]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [49]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [50]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [52]:
pd.value_counts(cats.codes)

0    5
2    3
1    3
3    1
dtype: int64

In [53]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
cats = pd.cut(ages, bins, labels=group_names)

In [54]:
cats

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [55]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-0.683, -0.00748], (-2.889, -0.683], (-2.889, -0.683], (0.661, 2.923], (-0.683, -0.00748], ..., (-0.00748, 0.661], (0.661, 2.923], (0.661, 2.923], (-2.889, -0.683], (-0.683, -0.00748]]
Length: 1000
Categories (4, interval[float64]): [(-2.889, -0.683] < (-0.683, -0.00748] < (-0.00748, 0.661] < (0.661, 2.923]]

In [56]:
pd.value_counts(cats)

(0.661, 2.923]        250
(-0.00748, 0.661]     250
(-0.683, -0.00748]    250
(-2.889, -0.683]      250
dtype: int64

In [57]:
pd.value_counts(pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]))

(-0.00748, 1.286]     400
(-1.166, -0.00748]    400
(1.286, 2.923]        100
(-2.889, -1.166]      100
dtype: int64

In [58]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.019454     0.046496    -0.012014    -0.032443
std       0.996484     0.980667     0.990962     0.966816
min      -3.267771    -3.688653    -3.344436    -2.873445
25%      -0.684385    -0.623411    -0.665133    -0.654113
50%       0.026062     0.056576     0.024894    -0.092533
75%       0.664555     0.681501     0.646170     0.591213
max       3.027263     2.982212     3.413920     3.103388

In [59]:
data[2][np.abs(data[2]) > 2].count()

46

In [60]:
df = pd.DataFrame(np.arange(20).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([1, 4, 2, 0, 3])

In [61]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [62]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [63]:
df.iloc[sampler]

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [64]:
df.sample(3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15